Revit 2026 API

# RebarShapeDefinitionByArcAddConstraintChordLength Method

---

Specify a parameter to drive the chord length (the straight-line distance between the endpoints of the arc).

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddConstraintChordLength(
	ElementId paramId
)
```
```vb
Public Sub AddConstraintChordLength (
	paramId As ElementId
)
```
```cpp
public:
void AddConstraintChordLength(
	ElementId^ paramId
)
```
```fsharp
member AddConstraintChordLength :
        paramId : ElementId -> unit
```

#### Parameters

paramId ElementId
     Id of a parameter to drive the constraint. To obtain the id of a shared parameter, call RebarShape.GetElementIdForExternalDefinition().

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The chord length is measured on the centerline of the bar.

#### Reference

RebarShapeDefinitionByArc Class

Autodesk.Revit.DB.Structure Namespace